# Урок 7
"""""
Задание №4 (Решить с помощью генераторов списка)
Написать функцию которая принимает на вход число от 1 до 100. 
Если число равно 13, функция поднимает исключительную ситуации ValueError иначе возвращает введенное число, 
возведенное в квадрат.
Далее написать основной код программы. Пользователь вводит число. 
Введенное число передаем параметром в написанную функцию и печатаем результат, который вернула функция. 
Обработать возможность возникновения исключительной ситуации, которая поднимается внутри функции.
"""""
